{
  "brief": "Brief",
  "cancel": "Cancel",
  "content": "Content",
  "copied": "Copied",
  "create": "Create",
  "delete": "Delete",
  "draft": "Draft",
  "drop_to_upload": "Drop to upload",
  "edit": "Edit",
  "error": "Error",
  "digital_world": "digital world",
  "friends": "Friends",
  "hashtags": "#Hashtags",
  "hello": "Hello",
  "loading": "Loading...",
  "media.copied.detail": "The media address has been copied to the clipboard.",
  "node_status": "Node status",
  "post.detail": "Datails",
  "post.folder.draft": "Draft",
  "post.folder.option": "Folder", 
  "post.folder.private": "Private",
  "post.folder.public": "Public",
  "post.link.create": "Creat a public link",
  "post.link.create_success": "Created successfully",
  "post.link.create_success.detail": "Link has been successfully created and will be publicly accessed until effective time.",
  "post.link.delete_confirm": "After deleting, the link will be permanently invalid, are you sure?",
  "post.link.delete_success": "Deleted successfully.",
  "post.link.delete_success.detail": "The link has been permanently invalid",
  "post.link.edit": "Edit",
  "post.link.edit_success": "Edited successfully",
  "post.link.edit_success.detail": "New link information has been edited successfully.",
  "post.link.expires": "Effective time",
  "post.link.expires.date_range": "Date Range",
  "post.link.expires.end_date": "Expired time",
  "post.link.expires.end_date.placeholder": "Specify the expired date",
  "post.link.expires.end_until": "Expire on the specified date",
  "post.link.expires.forever": "Never expire",
  "post.link.expires.start_date": "Effective date",
  "post.link.expires.start_date.placeholder": "Specify the effective date",
  "post.link.expires.start_from": "Effective on the specified date",
  "post.link.token": "Token",
  "post.link.token.placeholder": "Token of link,for example,\"token\" is the unique identification in /public/token",
  "post.signature.copy_success": "Signature copied.",
  "public.home": "Visit {name}'s {epress_name}",
  "public.query.error": "Loading error",
  "publish.brief.placeholder": "Want to say something?",
  "publish.content": "Add content",
  "publish.content.placeholder": "Write something nice…",
  "publish.date": "published on {date}",
  "publish.draft.submit": "Draft",
  "publish.expires": "Expire on {date}",
  "publish.expires.never": "Never expire.",
  "publish.left": "Left {left} character",
  "publish.media": "Add media",
  "publish.submit": "Publish",
  "publish.switch_mode": "Switch the mode of editor",
  "save": "Save",
  "settings": "Settings",
  "settings.introduce": "Introduce yourself",
  "settings.introduce.placeholder": "eg. the top 3 important things in your life",
  "settings.epress_location": "Node address",
  "settings.epress_location.placeholder": "Node's real physical address in your real life",
  "settings.epress_name": "Node name",
  "settings.epress_name.placeholder": "The description of this node in the digital world",
  "settings.friendship_agreements": "Friendship Agreements",
  "settings.friendship_agreements.placeholder": "Show to your friend before friendship confirmation, Markdown supported",
  "settings.location": "Residential address",
  "settings.location.placeholder": "Your physical residential address",
  "settings.name": "Network name",
  "settings.name.placeholder": "Your name in the digital world",
  "settings.realname": "Real name",
  "settings.realname.placeholder": "Your real name in your real life",
  "settings.save_success": "Updated successfully",
  "settings.save_success.detail": "New settings have taken effect",
  "settings.title": "Settings",
  "sign_uri": "Signature address",
  "signature.digest": "Digital fingerprint",
  "signature.signature": "Digital signature",
  "signature.signed_date": "Signature signed on {date}",
  "signature.title": "Signature",
  "signature.title.detail": "The following is the detailed signature information for this article,you can verify this signature  using the ECDSA algorithm.Public key information can be obtained by clicking on the small icon labeled \"i\" in the upper  right corner.",
  "signature.what": "What is this?",
  "signature.what.detail": "In the physical world, how can we prove that an article is indeed published by yourself but not someone else. **Signature**---it has solved this problem well in the long history of the physical world, because each signature has unique handwriting in a certain range of time and space, moreover, it’s difficult to forge. The signature is the guarantee of credit in the physical world,such as IOU,College extrance examination paper,property ownership certificate, even US President’s legislative documents, all of them needs your or US President's signature as credit.\n\nIn the digital world,how should we face this problem? In fact,the current netword is working well without signature, For example, when you post anything on the Twitter or Facebook, it’s not required for you to support similar signature as credit. Because you have the control power of the account, to a certain extent, your friends think that the article sent from this account comes from you. Just like each article published here it can’t be published until it’s verified by my personal login permission. But this is not foolproof, let’s take some examples here([Jack Dorsey's Twitter account was hacked](https://www.theverge.com/2016/7/9/12134754/ceo-jack-dorseys-twitter-account-hack)),one more([Hundreds of Instagram users report similarly hacked accounts](https://www.engadget.com/2018/08/14/instagram-users-report-similarly-hacked-accounts/)). Even though the CEO of Twitter, and a big company like Facebook, none of them can avoid such security issues. So, do you have any reason to believe that each word you see here indeed comes from me but not what the hacker wants you to see. I believe it’s easy for hackers to break through here. The current security's input and output is just out of proportion.Common speaking, no one notices you, it’s just like you are invisible, so you are safe.\n\nBut if one day, it will be profitable to break through here (this is not a cranky thought), it holds all my private information, and my friends often need to learn my dynamics and communicate with me here. Just like someone’s WhatsApp or Snapchat was stolen, his family or friends recieved the loan information. This will be a high probability event, it depends on how much you depends on it. So my friends, how can you ensure that what you see here is what I post personally but not what posted in my name by some unscrupulous persons attacking me. After all, in the virtual digital world, no one knows whether the other end of the network cable that is communicating with you is a person or a dog, maybe a zoombie robot.\n\nThe Bitcoin network provides us with a very good reference for this. Using asymmetric encryption algorithms to generate unique and unforgeable digital signatures for each transaction provides a solid and reliable cornerstone for the Bitcoin network. The Bitcoin network has been running safely and steadily for more than a decade. In fact, as early as the Bitcoin network, asymmetric encryption has been widely used in various fields. For example, we browse the HTTPS protocol used every day on the Internet. When we visit a site that supports the HTTPS protocol, we don't have to worry about the pages we see being tampered with in transit by unscrupulous persons. \n\nHere, I use the bitcoin-compatible asymmetric encryption algorithm ECDSA to provide ** digital signature**, each article in the system has its own unique digital fingerprint, just like the signature in the physical world it has a unique handwriting, this is its unique digital fingerprint, with this we can have private key(it’s visible by ourslves only).To use the ECDSA algorithm, it generates a unique and unforgeable **digital signature**. with this unique digital fingerprint as well as a public key available(if public key is tampered with, all signatures in history will not be verified, and permanent addresses will be changed accordingly.) It will be very easy for you to verify whether each word in the article is sent by me personally,because even if you modify a punctuation in the article, the signature verification will not pass. Therefore, as long as the article has digital signature, you can regard that the article you see is really sent by myself unless my private key is stolen, but in this case, even in the bitcoin netword, it means you will permanently lose control of the digital assets under the account, just like in the physical world, if you lose your wallet you will permanently lose the cash inside.\n\nIn a word,if there’s any article published without my digital signature, you can regard it as something I didn't sent (even in my system). To a greater extent, you can completely think that the digital signature here is equivalent to my own signature in the physical world and they have the same effect. Because of digital signatures, you can be more convinced of each character published here than that on Twitter and Facebook, or any other existing web service.",
  "signed": "Signed",
  "signin": "Signin",
  "signin.copied.message": "Please submit your signature information within {date} minutes to sign in",
  "signin.copied.title": "Signature information copied.",
  "signin.title": "Signin ",
  "signout": "Signout",
  "status.address": "Permanent address",
  "status.install_time": "Installation time",
  "status.key": "Key",
  "status.pubKey": "Public key",
  "status.up_time": "Start time",
  "status.value": "Value",
  "status.version": "Version",
  "test": "Test",
  "timeline": "Timeline",
  "timeline.create.title": "Post a new article",
  "timeline.edit.title": "Edit article",
  "timeline.editor.update_success": "Edited successfully",
  "timeline.editor.update_success.detail": "All amendments have taken effect",
  "timeline.index.load_more": "Earlier content",
  "timeline.index.page_title": "Timeline",
  "timeline.post.delete_confirm": "The article can’t be restored after deleting,are you sure to delete?",
  "timeline.post.delete_success": "Removed successfully.",
  "timeline.post.delete_success.detail": "The article has been removed completely",
  "timeline.view.page_title": "View details",
  "unsigned": "Unsigned",
  "view": "View"
}
